{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\GideonNtiBoateng\Desktop\Post_Grad\Stata_Works\logNew.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Feb 2024, 14:23:11
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\GIDEON~1\AppData\Local\Temp\STD6180_000000.tmp"
{txt}
{com}. 
. clear
{txt}
{com}. 
. * open a data
. sysuse auto
{txt}(1978 automobile data)

{com}. 
. * summarizing your data in stata
. summarize

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}make {c |}{res}          0
{txt}{space 7}price {c |}{res}         74    6165.257    2949.496       3291      15906
{txt}{space 9}mpg {c |}{res}         74     21.2973    5.785503         12         41
{txt}{space 7}rep78 {c |}{res}         69    3.405797    .9899323          1          5
{txt}{space 4}headroom {c |}{res}         74    2.993243    .8459948        1.5          5
{txt}{hline 13}{c +}{hline 57}
{space 7}trunk {c |}{res}         74    13.75676    4.277404          5         23
{txt}{space 6}weight {c |}{res}         74    3019.459    777.1936       1760       4840
{txt}{space 6}length {c |}{res}         74    187.9324    22.26634        142        233
{txt}{space 8}turn {c |}{res}         74    39.64865    4.399354         31         51
{txt}displacement {c |}{res}         74    197.2973    91.83722         79        425
{txt}{hline 13}{c +}{hline 57}
{space 2}gear_ratio {c |}{res}         74    3.014865    .4562871       2.19       3.89
{txt}{space 5}foreign {c |}{res}         74    .2972973    .4601885          0          1
{txt}
{com}. 
. generate x = 1
{txt}
{com}. 
. do test_do_file
{txt}
{com}. 
. clear
{txt}
{com}. 
. sysuse auto
{txt}(1978 automobile data)

{com}. 
. summarize

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}make {c |}{res}          0
{txt}{space 7}price {c |}{res}         74    6165.257    2949.496       3291      15906
{txt}{space 9}mpg {c |}{res}         74     21.2973    5.785503         12         41
{txt}{space 7}rep78 {c |}{res}         69    3.405797    .9899323          1          5
{txt}{space 4}headroom {c |}{res}         74    2.993243    .8459948        1.5          5
{txt}{hline 13}{c +}{hline 57}
{space 7}trunk {c |}{res}         74    13.75676    4.277404          5         23
{txt}{space 6}weight {c |}{res}         74    3019.459    777.1936       1760       4840
{txt}{space 6}length {c |}{res}         74    187.9324    22.26634        142        233
{txt}{space 8}turn {c |}{res}         74    39.64865    4.399354         31         51
{txt}displacement {c |}{res}         74    197.2973    91.83722         79        425
{txt}{hline 13}{c +}{hline 57}
{space 2}gear_ratio {c |}{res}         74    3.014865    .4562871       2.19       3.89
{txt}{space 5}foreign {c |}{res}         74    .2972973    .4601885          0          1
{txt}
{com}. 
. generate x = 1
{txt}
{com}. 
{txt}end of do-file

{com}. 
. * how to use the log command
. 
. help log
{txt}
{com}. 
. log using log2
{err}log file already open
{txt}{search r(604), local:r(604);}

end of do-file

{search r(604), local:r(604);}

{com}. do "C:\Users\GIDEON~1\AppData\Local\Temp\STD6180_000000.tmp"
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\GideonNtiBoateng\Desktop\Post_Grad\Stata_Works\logNew.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Feb 2024, 14:24:23
{txt}{.-}
{smcl}
{txt}{sf}{ul off}{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\GideonNtiBoateng\Desktop\Post_Grad\Stata_Works\logNew.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Feb 2024, 14:28:04
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\GIDEON~1\AppData\Local\Temp\STD6180_000000.tmp"
{txt}
{com}. log using log2, replace
{err}log file already open
{txt}{search r(604), local:r(604);}

end of do-file

{search r(604), local:r(604);}

{com}. do "C:\Users\GIDEON~1\AppData\Local\Temp\STD6180_000000.tmp"
{txt}
{com}. log using logNew, replace
{err}log file already open
{txt}{search r(604), local:r(604);}

end of do-file

{search r(604), local:r(604);}

{com}. do "C:\Users\GIDEON~1\AppData\Local\Temp\STD6180_000000.tmp"
{txt}
{com}. log using logNew, replace
{err}log file already open
{txt}{search r(604), local:r(604);}

end of do-file

{search r(604), local:r(604);}

{com}. do "C:\Users\GIDEON~1\AppData\Local\Temp\STD6180_000000.tmp"
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\GideonNtiBoateng\Desktop\Post_Grad\Stata_Works\logNew.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Feb 2024, 14:30:28
{txt}{.-}
{smcl}
{txt}{sf}{ul off}